<a href="https://colab.research.google.com/github/sandhyaparna/Python-DataScience-CookBook/blob/master/Modeling/Feature_Engineering.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import numpy as np
import pandas as pd

In [8]:
# Create data with column name "Age" with random ints between 5 & 100; size is number of rows/random numbers to be generated
RandomData = pd.DataFrame(np.random.randint(5,100,size=1000), columns=['Age'])

# Adding time variable - generate random dates
# pd.date_range(start='1990-01-01',end='2000-12-31') creates all dates between the selected range
# np.random.choice chooses dates randomly from the above for the mentioned number of times
# range(RandomData.shape[0]) chooses dates for 1000 times i.e number of rows in RandomData table
RandomData['Date_of_Birth'] = [np.random.choice(pd.date_range(start='1990-01-01',end='2000-12-31')) for i in range(RandomData.shape[0])]
RandomData.head()

   Age Date_of_Birth
0   49    1992-02-19
1   87    1995-08-10
2   53    2000-03-24
3   55    1993-07-21
4   80    1996-04-04

### Temporal Columns

In [15]:
TemporalData = RandomData.copy()
TemporalData['year'] = TemporalData['Date_of_Birth'].dt.year
TemporalData['month'] = TemporalData['Date_of_Birth'].dt.month
TemporalData['day'] = TemporalData['Date_of_Birth'].dt.day
TemporalData['hour'] = TemporalData['Date_of_Birth'].dt.hour
TemporalData['day_name'] = TemporalData['Date_of_Birth'].dt.day_name()
TemporalData['day'] = TemporalData['Date_of_Birth'].dt.day

TemporalData.head()

   Age Date_of_Birth  year  month  day  hour   day_name
0   49    1992-02-19  1992      2   19     0  Wednesday
1   87    1995-08-10  1995      8   10     0   Thursday
2   53    2000-03-24  2000      3   24     0     Friday
3   55    1993-07-21  1993      7   21     0  Wednesday
4   80    1996-04-04  1996      4    4     0   Thursday

In [20]:
# is_weekend flag 
day_names = TemporalData.Date_of_Birth.dt.day_name()
TemporalData['is_weekend'] = TemporalData['day_name'].apply(lambda x : 1 if x in ['Saturday','Sunday'] else 0)
TemporalData.head()

   Age Date_of_Birth  year  month  day  hour   day_name  is_weekend
0   49    1992-02-19  1992      2   19     0  Wednesday           0
1   87    1995-08-10  1995      8   10     0   Thursday           0
2   53    2000-03-24  2000      3   24     0     Friday           0
3   55    1993-07-21  1993      7   21     0  Wednesday           0
4   80    1996-04-04  1996      4    4     0   Thursday           0

In [10]:
# Here we map each temporal variable onto a circle such that the lowest value for that variable appears right next to the largest value. We compute the x- and y- component of that point using the sin and cos trigonometric functions.
TemporalData['day_sin'] = np.sin(TemporalData.day*(2.*np.pi/31))
TemporalData['day_cos'] = np.cos(TemporalData.day*(2.*np.pi/31))
TemporalData['month_sin'] = np.sin((TemporalData.month-1)*(2.*np.pi/12))
TemporalData['month_cos'] = np.cos((TemporalData.month-1)*(2.*np.pi/12))

In [14]:
TemporalData[TemporalData.day==1].head()

     Age Date_of_Birth  year  month  ...   day_sin  day_cos  month_sin     month_cos
41    73    1994-04-01  1994      4  ...  0.201299  0.97953   1.000000  6.123234e-17
59    68    1998-03-01  1998      3  ...  0.201299  0.97953   0.866025  5.000000e-01
71    13    1996-12-01  1996     12  ...  0.201299  0.97953  -0.500000  8.660254e-01
154   29    1998-11-01  1998     11  ...  0.201299  0.97953  -0.866025  5.000000e-01
156   43    2000-08-01  2000      8  ...  0.201299  0.97953  -0.500000 -8.660254e-01

[5 rows x 9 columns]

In [11]:
# Get the first entry for each month.
TemporalData.groupby('day').first()

     Age Date_of_Birth  year  ...   day_cos     month_sin     month_cos
day                           ...
1     73    1994-04-01  1994  ...  0.979530  1.000000e+00  6.123234e-17
2     37    2000-11-02  2000  ...  0.918958 -8.660254e-01  5.000000e-01
3     24    2000-12-03  2000  ...  0.820763 -5.000000e-01  8.660254e-01
4     80    1996-04-04  1996  ...  0.688967  1.000000e+00  6.123234e-17
5     49    1994-01-05  1994  ...  0.528964  0.000000e+00  1.000000e+00
6     49    1990-11-06  1990  ...  0.347305 -8.660254e-01  5.000000e-01
7     74    2000-09-07  2000  ...  0.151428 -8.660254e-01 -5.000000e-01
8     48    1995-08-08  1995  ... -0.050649 -5.000000e-01 -8.660254e-01
9     54    1999-02-09  1999  ... -0.250653  5.000000e-01  8.660254e-01
10    87    1995-08-10  1995  ... -0.440394 -5.000000e-01 -8.660254e-01
11    13    1996-04-11  1996  ... -0.612106  1.000000e+00  6.123234e-17
12    45    1996-01-12  1996  ... -0.758758  0.000000e+00  1.000000e+00
13    45    1991-11-13  1991  ... -0.874347 -8.660254e-01  5.000000e-01
14    81    1991-10-14  1991  ... -0.954139 -1.000000e+00 -1.836970e-16
15    59    1999-10-15  1999  ... -0.994869 -1.000000e+00 -1.836970e-16
16    84    1994-01-16  1994  ... -0.994869  0.000000e+00  1.000000e+00
17    96    1996-07-17  1996  ... -0.954139  1.224647e-16 -1.000000e+00
18    62    1997-02-18  1997  ... -0.874347  5.000000e-01  8.660254e-01
19    49    1992-02-19  1992  ... -0.758758  5.000000e-01  8.660254e-01
20    78    1996-10-20  1996  ... -0.612106 -1.000000e+00 -1.836970e-16
21    55    1993-07-21  1993  ... -0.440394  1.224647e-16 -1.000000e+00
22    12    1993-10-22  1993  ... -0.250653 -1.000000e+00 -1.836970e-16
23    89    1999-11-23  1999  ... -0.050649 -8.660254e-01  5.000000e-01
24    53    2000-03-24  2000  ...  0.151428  8.660254e-01  5.000000e-01
25    87    1995-06-25  1995  ...  0.347305  5.000000e-01 -8.660254e-01
26    88    1992-04-26  1992  ...  0.528964  1.000000e+00  6.123234e-17
27    55    1997-06-27  1997  ...  0.688967  5.000000e-01 -8.660254e-01
28    57    1990-04-28  1990  ...  0.820763  1.000000e+00  6.123234e-17
29    92    1994-06-29  1994  ...  0.918958  5.000000e-01 -8.660254e-01
30    32    1993-11-30  1993  ...  0.979530 -8.660254e-01  5.000000e-01
31    45    1996-05-31  1996  ...  1.000000  8.660254e-01 -5.000000e-01

[31 rows x 8 columns]

In [12]:
# For month, month_sin is on X-axis and	month_cos is on y-axis. 1 to 12 are co-ordinates of points on a circle 
TemporalData.groupby('month').first()

       Age Date_of_Birth  year  ...   day_cos     month_sin     month_cos
month                           ...
1       49    1994-01-05  1994  ...  0.528964  0.000000e+00  1.000000e+00
2       49    1992-02-19  1992  ... -0.758758  5.000000e-01  8.660254e-01
3       53    2000-03-24  2000  ...  0.151428  8.660254e-01  5.000000e-01
4       80    1996-04-04  1996  ...  0.688967  1.000000e+00  6.123234e-17
5       45    1996-05-31  1996  ...  1.000000  8.660254e-01 -5.000000e-01
6       87    1995-06-25  1995  ...  0.347305  5.000000e-01 -8.660254e-01
7       55    1993-07-21  1993  ... -0.440394  1.224647e-16 -1.000000e+00
8       87    1995-08-10  1995  ... -0.440394 -5.000000e-01 -8.660254e-01
9       74    2000-09-07  2000  ...  0.151428 -8.660254e-01 -5.000000e-01
10      81    1991-10-14  1991  ... -0.954139 -1.000000e+00 -1.836970e-16
11      12    1999-11-26  1999  ...  0.528964 -8.660254e-01  5.000000e-01
12      46    1999-12-10  1999  ... -0.440394 -5.000000e-01  8.660254e-01

[12 rows x 8 columns]